In [41]:
import pandas as pd

student_list = [
    {'name':'John','major':'computer science','sex':'male'},
    {'name':'Nate','major':'computer science','sex':'female'},
    {'name':'Abraham','major':'physics','sex':'male'},
    {'name':'Brian','major':'psychology','sex':'male'},
    {'name':'Janny','major':'Economic','sex':'female'},
    {'name':'Yuna','major':'Economic','sex':'female'},
    {'name':'Jeniffer','major':'computer science','sex':'female'},
    {'name':'Edward','major':'computer science','sex':'male'},
    {'name':'Zara','major':'psychology','sex':'male'},
    {'name':'Sera','major':'physics','sex':'female'},
]
df = pd.DataFrame(student_list, columns = ['name','major','sex'])
df

       name             major     sex
0      John  computer science    male
1      Nate  computer science  female
2   Abraham           physics    male
3     Brian        psychology    male
4     Janny          Economic  female
5      Yuna          Economic  female
6  Jeniffer  computer science  female
7    Edward  computer science    male
8      Zara        psychology    male
9      Sera           physics  female

In [49]:
groupby_major = df.groupby('major')
groupby_major.groups
for name, group in groupby_major:
    print(name + " : " + str(len(group)))
    print(group)
    print() #한줄 공란

Economic : 2
    name     major     sex
4  Janny  Economic  female
5   Yuna  Economic  female

computer science : 4
       name             major     sex
0      John  computer science    male
1      Nate  computer science  female
6  Jeniffer  computer science  female
7    Edward  computer science    male

physics : 2
      name    major     sex
2  Abraham  physics    male
9     Sera  physics  female

psychology : 2
    name       major   sex
3  Brian  psychology  male
8   Zara  psychology  male

In [43]:
df_major_cnt = pd.DataFrame({'count' : groupby_major.size()}).reset_index()
df_major_cnt

              major  count
0          Economic      2
1  computer science      4
2           physics      2
3        psychology      2

In [54]:
groupby_major = df.groupby('sex')
for name, group in groupby_major:
    print(name + " : " + str(len(group)))
    print(group)
    print()

female : 5
       name             major     sex
1      Nate  computer science  female
4     Janny          Economic  female
5      Yuna          Economic  female
6  Jeniffer  computer science  female
9      Sera           physics  female

male : 5
      name             major   sex
0     John  computer science  male
2  Abraham           physics  male
3    Brian        psychology  male
7   Edward  computer science  male
8     Zara        psychology  male

In [ ]:
#중복데이터 삭제하기